sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_aes.h
/* AES_AESACTL0 Bits */
/* AES_AESACTL0[OPX] Bits */
#define AES_AESACTL0_OPX_OFS                     (0)                             /* !< OPX Offset */
#define AES_AESACTL0_OPX_MASK                    ((uint32_t)0x00000003U)         /* !< AES operation. The AESOPx bits are
                                                                                    not reset by AESSWRST = 1. Writes are
                                                                                    ignored when AESCMEN = 1 and
                                                                                    AESBLKCNTx > 0. 00b = Encryption. 01b
                                                                                    = Decryption. The provided key is the
                                                                                    same key used for encryption. 10b =
                                                                                    Generate first round key required for
                                                                                    decryption. 11b = Decryption. The
                                                                                    provided key is the first round key
                                                                                    required for decryption. */
#define AES_AESACTL0_OPX_OP0                     ((uint32_t)0x00000000U)         /* !< Encryption */
#define AES_AESACTL0_OPX_OP1                     ((uint32_t)0x00000001U)         /* !< Decryption. The provided key is the
                                                                                    same key used for encryption. */
#define AES_AESACTL0_OPX_OP2                     ((uint32_t)0x00000002U)         /* !< Generate first round key required
                                                                                    for decryption. */
#define AES_AESACTL0_OPX_OP3                     ((uint32_t)0x00000003U)         /* !< Decryption. The provided key is the
                                                                                    first round key required for
                                                                                    decryption. */
/* AES_AESACTL0[KLX] Bits */
#define AES_AESACTL0_KLX_OFS                     (2)                             /* !< KLX Offset */
#define AES_AESACTL0_KLX_MASK                    ((uint32_t)0x0000000CU)         /* !< AES key length.  These bits define
                                                                                    which of the 1 AES standards is
                                                                                    performed. The AESKLx bits are not
                                                                                    reset by AESSWRST = 1. Writes are
                                                                                    ignored when AESCMEN = 1 and
                                                                                    AESBLKCNTx > 0. */
#define AES_AESACTL0_KLX_AES128                  ((uint32_t)0x00000000U)         /* !< The key size is 128 bit. */
#define AES_AESACTL0_KLX_AES256                  ((uint32_t)0x00000008U)         /* !< The key size is 256 bit. */
/* AES_AESACTL0[CMX] Bits */
#define AES_AESACTL0_CMX_OFS                     (5)                             /* !< CMX Offset */
#define AES_AESACTL0_CMX_MASK                    ((uint32_t)0x00000060U)         /* !< AES cipher mode select. These bits
                                                                                    are ignored for AESCMEN = 0. Writes
                                                                                    are ignored when AESCMEN = 1 and
                                                                                    AESBLKCNTx > 0. 00b = ECB 01b = CBC
                                                                                    10b = OFB 11b = CFB */
#define AES_AESACTL0_CMX_ECB                     ((uint32_t)0x00000000U)         /* !< ECB */
#define AES_AESACTL0_CMX_CBC                     ((uint32_t)0x00000020U)         /* !< CBC */
#define AES_AESACTL0_CMX_OFB                     ((uint32_t)0x00000040U)         /* !< OFB */
#define AES_AESACTL0_CMX_CFB                     ((uint32_t)0x00000060U)         /* !< CFB */
/* AES_AESACTL0[SWRST] Bits */
#define AES_AESACTL0_SWRST_OFS                   (7)                             /* !< SWRST Offset */
#define AES_AESACTL0_SWRST_MASK                  ((uint32_t)0x00000080U)         /* !< AES software reset.  Immediately
                                                                                    resets the complete AES accelerator
                                                                                    module even when busy except for the
                                                                                    AESRDYIE, the AESKLx and the AESOPx
                                                                                    bits. It also clears the (internal)
                                                                                    state memory. The AESSWRST bit is
                                                                                    automatically reset and is always
                                                                                    read as zero. 0b = No reset 1b =
                                                                                    Reset AES accelerator module */
#define AES_AESACTL0_SWRST_NORST                 ((uint32_t)0x00000000U)         /* !< No reset. */
#define AES_AESACTL0_SWRST_RST                   ((uint32_t)0x00000080U)         /* !< Reset AES accelerator module. */
/* AES_AESACTL0[ERRFG] Bits */
#define AES_AESACTL0_ERRFG_OFS                   (11)                            /* !< ERRFG Offset */
#define AES_AESACTL0_ERRFG_MASK                  ((uint32_t)0x00000800U)         /* !< AES error flag.  AESAKEY or AESADIN
                                                                                    were written while an AES operation
                                                                                    was in progress. The bit must be
                                                                                    cleared by software. 0b = No error 1b
                                                                                    = Error occurred */
#define AES_AESACTL0_ERRFG_NOERR                 ((uint32_t)0x00000000U)         /* !< No error */
#define AES_AESACTL0_ERRFG_ERR                   ((uint32_t)0x00000800U)         /* !< Error occurred */
/* AES_AESACTL0[CMEN] Bits */
#define AES_AESACTL0_CMEN_OFS                    (15)                            /* !< CMEN Offset */
#define AES_AESACTL0_CMEN_MASK                   ((uint32_t)0x00008000U)         /* !< AESCMEN enables the support of the
                                                                                    cipher modes ECB, CBC, OFB and CFB
                                                                                    together with the DMA. Writes are
                                                                                    ignored when AESCMEN = 1 and
                                                                                    AESBLKCNTx > 0. 0 = No DMA triggers
                                                                                    are generated. 1 = DMA cipher mode
                                                                                    support operation is enabled and the
                                                                                    corresponding DMA triggers are
                                                                                    generated. */
#define AES_AESACTL0_CMEN_DISABLE                ((uint32_t)0x00000000U)         /* !< No DMA triggers are generated. */
#define AES_AESACTL0_CMEN_ENABLE                 ((uint32_t)0x00008000U)         /* !< DMA cipher mode support operation
                                                                                    is enabled and the corresponding DMA
                                                                                    triggers are generated. */

/* AES_AESACTL1 Bits */
/* AES_AESACTL1[BLKCNTX] Bits */
#define AES_AESACTL1_BLKCNTX_OFS                 (0)                             /* !< BLKCNTX Offset */
#define AES_AESACTL1_BLKCNTX_MASK                ((uint32_t)0x000000FFU)         /* !< Cipher Block Counter. Number of
                                                                                    blocks to be encrypted or decrypted
                                                                                    with block cipher modes enabled
                                                                                    (AESCMEN = 1). Ignored if AESCMEN =
                                                                                    0. The block counter decrements with
                                                                                    each performed encryption or
                                                                                    decryption. Writes are ignored when
                                                                                    AESCMEN = 1 and AESBLKCNTx > 0. */
#define AES_AESACTL1_BLKCNTX_MINNUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define AES_AESACTL1_BLKCNTX_ENABLE              ((uint32_t)0x000000FFU)         /* !< Highest possible value */

