sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_aes.h
/* AES_AESAKEY Bits */
/* AES_AESAKEY[KEY0X] Bits */
#define AES_AESAKEY_KEY0X_OFS                    (0)                             /* !< KEY0X Offset */
#define AES_AESAKEY_KEY0X_MASK                   ((uint32_t)0x000000FFU)         /* !< AES key byte n when AESAKEY is
                                                                                    written as word. AES next key byte
                                                                                    when AESAKEY is written as byte. Do
                                                                                    not mix word and byte access. Always
                                                                                    reads as zero. The key is reset by
                                                                                    PUC or by AESSWRST = 1. */
#define AES_AESAKEY_KEY0X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY0X_MAXNUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* AES_AESAKEY[KEY1X] Bits */
#define AES_AESAKEY_KEY1X_OFS                    (8)                             /* !< KEY1X Offset */
#define AES_AESAKEY_KEY1X_MASK                   ((uint32_t)0x0000FF00U)         /* !< AES key byte n+1 when AESAKEY is
                                                                                    written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. The key is reset by PUC or by
                                                                                    AESSWRST = 1. */
#define AES_AESAKEY_KEY1X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY1X_MAXNUM                 ((uint32_t)0x0000FF00U)         /* !< Highest possible value */
/* AES_AESAKEY[KEY2X] Bits */
#define AES_AESAKEY_KEY2X_OFS                    (16)                            /* !< KEY2X Offset */
#define AES_AESAKEY_KEY2X_MASK                   ((uint32_t)0x00FF0000U)         /* !< AES key byte n+2 when AESAKEY is
                                                                                    written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. The key is reset by PUC or by
                                                                                    AESSWRST = 1. */
#define AES_AESAKEY_KEY2X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY2X_MAXNUM                 ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* AES_AESAKEY[KEY3X] Bits */
#define AES_AESAKEY_KEY3X_OFS                    (24)                            /* !< KEY3X Offset */
#define AES_AESAKEY_KEY3X_MASK                   ((uint32_t)0xFF000000U)         /* !< AES key byte n+3 when AESAKEY is
                                                                                    written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. The key is reset by PUC or by
                                                                                    AESSWRST = 1. */
#define AES_AESAKEY_KEY3X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY3X_MAXNUM                 ((uint32_t)0xFF000000U)         /* !< Highest possible value */

/* AES_AESADIN Bits */
/* AES_AESADIN[DIN0X] Bits */
#define AES_AESADIN_DIN0X_OFS                    (0)                             /* !< DIN0X Offset */
#define AES_AESADIN_DIN0X_MASK                   ((uint32_t)0x000000FFU)         /* !< AES data in byte n when AESADIN is
                                                                                    written as word. AES next data in
                                                                                    byte when AESADIN is written as byte.
                                                                                    Do not mix word and byte access.
                                                                                    Always reads as zero. */
#define AES_AESADIN_DIN0X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADIN_DIN0X_MAXNUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* AES_AESADIN[DIN1X] Bits */
#define AES_AESADIN_DIN1X_OFS                    (8)                             /* !< DIN1X Offset */
#define AES_AESADIN_DIN1X_MASK                   ((uint32_t)0x0000FF00U)         /* !< AES data in byte n+1 when AESADIN
                                                                                    is written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. */
#define AES_AESADIN_DIN1X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADIN_DIN1X_MAXNUM                 ((uint32_t)0x0000FF00U)         /* !< Highest possible value */
/* AES_AESADIN[DIN2X] Bits */
#define AES_AESADIN_DIN2X_OFS                    (16)                            /* !< DIN2X Offset */
#define AES_AESADIN_DIN2X_MASK                   ((uint32_t)0x00FF0000U)         /* !< AES data in byte n+2 when AESADIN
                                                                                    is written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. */
#define AES_AESADIN_DIN2X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADIN_DIN2X_MAXNUM                 ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* AES_AESADIN[DIN3X] Bits */
#define AES_AESADIN_DIN3X_OFS                    (24)                            /* !< DIN3X Offset */
#define AES_AESADIN_DIN3X_MASK                   ((uint32_t)0xFF000000U)         /* !< AES data in byte n+3 when AESADIN
                                                                                    is written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. */
#define AES_AESADIN_DIN3X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADIN_DIN3X_MAXNUM                 ((uint32_t)0xFF000000U)         /* !< Highest possible value */

/* AES_AESADOUT Bits */
/* AES_AESADOUT[DOUT0X] Bits */
#define AES_AESADOUT_DOUT0X_OFS                  (0)                             /* !< DOUT0X Offset */
#define AES_AESADOUT_DOUT0X_MASK                 ((uint32_t)0x000000FFU)         /* !< AES data out byte n when AESADOUT
                                                                                    is read as word. AES next data out
                                                                                    byte when AESADOUT is read as byte.
                                                                                    Do not mix word and byte access. */
#define AES_AESADOUT_DOUT0X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADOUT_DOUT0X_MAXNUM               ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* AES_AESADOUT[DOUT1X] Bits */
#define AES_AESADOUT_DOUT1X_OFS                  (8)                             /* !< DOUT1X Offset */
#define AES_AESADOUT_DOUT1X_MASK                 ((uint32_t)0x0000FF00U)         /* !< AES data out byte n+1 when AESADOUT
                                                                                    is read as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. */
#define AES_AESADOUT_DOUT1X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADOUT_DOUT1X_MAXNUM               ((uint32_t)0x0000FF00U)         /* !< Highest possible value */
/* AES_AESADOUT[DOUT2X] Bits */
#define AES_AESADOUT_DOUT2X_OFS                  (16)                            /* !< DOUT2X Offset */
#define AES_AESADOUT_DOUT2X_MASK                 ((uint32_t)0x00FF0000U)         /* !< AES data out byte n+2 when AESADOUT
                                                                                    is read as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. */
#define AES_AESADOUT_DOUT2X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADOUT_DOUT2X_MAXNUM               ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* AES_AESADOUT[DOUT3X] Bits */
#define AES_AESADOUT_DOUT3X_OFS                  (24)                            /* !< DOUT3X Offset */
#define AES_AESADOUT_DOUT3X_MASK                 ((uint32_t)0xFF000000U)         /* !< AES data out byte n+3 when AESADOUT
                                                                                    is read as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. */
#define AES_AESADOUT_DOUT3X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESADOUT_DOUT3X_MAXNUM               ((uint32_t)0xFF000000U)         /* !< Highest possible value */

/* AES_AESAXDIN Bits */
/* AES_AESAXDIN[XDIN0X] Bits */
#define AES_AESAXDIN_XDIN0X_OFS                  (0)                             /* !< XDIN0X Offset */
#define AES_AESAXDIN_XDIN0X_MASK                 ((uint32_t)0x000000FFU)         /* !< AES data in byte n when AESAXDIN is
                                                                                    written as word. AES next data in
                                                                                    byte when AESAXDIN is written as
                                                                                    byte. Do not mix word and byte
                                                                                    access. Always reads as zero. */
#define AES_AESAXDIN_XDIN0X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAXDIN_XDIN0X_MAXNUM               ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* AES_AESAXDIN[XDIN1X] Bits */
#define AES_AESAXDIN_XDIN1X_OFS                  (8)                             /* !< XDIN1X Offset */
#define AES_AESAXDIN_XDIN1X_MASK                 ((uint32_t)0x0000FF00U)         /* !< AES data in byte n+1 when AESAXDIN
                                                                                    is written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. */
#define AES_AESAXDIN_XDIN1X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAXDIN_XDIN1X_MAXNUM               ((uint32_t)0x0000FF00U)         /* !< Highest possible value */
/* AES_AESAXDIN[XDIN2X] Bits */
#define AES_AESAXDIN_XDIN2X_OFS                  (16)                            /* !< XDIN2X Offset */
#define AES_AESAXDIN_XDIN2X_MASK                 ((uint32_t)0x00FF0000U)         /* !< AES data in byte n+2 when AESAXDIN
                                                                                    is written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. */
#define AES_AESAXDIN_XDIN2X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAXDIN_XDIN2X_MAXNUM               ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* AES_AESAXDIN[XDIN3X] Bits */
#define AES_AESAXDIN_XDIN3X_OFS                  (24)                            /* !< XDIN3X Offset */
#define AES_AESAXDIN_XDIN3X_MASK                 ((uint32_t)0xFF000000U)         /* !< AES data in byte n+3 when AESAXDIN
                                                                                    is written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. */
#define AES_AESAXDIN_XDIN3X_MINNUM               ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAXDIN_XDIN3X_MAXNUM               ((uint32_t)0xFF000000U)         /* !< Highest possible value */

